public class Main {
    public static void main(String[] args) {
/**Сабакта биз тузгон таблицалардан:

 1. HTC компаниясынан башка компаниянын продуктуларын алыныз
 2. Apple компаниясынын 75000минден томонку баадагы продуктуларын алыныз.
 3. Баасы 46000 жана андан ойдоку продуктулардын баарын алыныз
 4. Эн кымбат эки продукту алыныз
 5. Баасы минимальный болгон продуктун атын алыныз
 6. Дискоунт болгон продуктуларды чыгарыныз.
 7. Дискоунт болбогон продуктуларды чыгарыныз.
 8. Баардык продуктулардын баасын кымбаттан арзанга карап чыгарыныз
 9. Баардык продуктулардын суммасын(баасын) чыгарыныз.
 10. Эки жана андан аз продуктусу бар компанияларды алыныз*/
    }
}
